app/views/devise/sessions/_easy_login.html.erb

SELECT "users".* FROM "users"
---
Log in as: <select class='easylogin'>
	<%=
		["<option value='' data-email='' data-pw=''></option>"].concat( User.all.collect do |u|
			"<option value=#{u.id} data-email='#{u.email}' data-pw='abcd1234'>#{u.first} #{u.last}; #{u.roles_to_s}</option>"
		end).join.html_safe